update network image
